Sorting & Filtering

Sort DataFrame by one or more columns.

In [1]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "dept": ["HR", "HR", "IT", "IT", "IT", "HR"],
    "age": [25, 30, 35, 28, 40, 32],
    "salary": [50000, 60000, 70000, 80000, 75000, 65000]
})

df

      name dept  age  salary
0    Alice   HR   25   50000
1      Bob   HR   30   60000
2  Charlie   IT   35   70000
3    David   IT   28   80000
4      Eve   IT   40   75000
5    Frank   HR   32   65000

In [6]:
df.sort_values(by="salary", ascending=False, inplace=True)
df

      name dept  age  salary
3    David   IT   28   80000
4      Eve   IT   40   75000
2  Charlie   IT   35   70000
5    Frank   HR   32   65000
1      Bob   HR   30   60000
0    Alice   HR   25   50000

Filter rows based on multiple conditions.

In [8]:
df.sort_values(
    by=["age", "salary"],
    ascending=[True, False]
)

      name dept  age  salary
0    Alice   HR   25   50000
3    David   IT   28   80000
1      Bob   HR   30   60000
5    Frank   HR   32   65000
2  Charlie   IT   35   70000
4      Eve   IT   40   75000

In [10]:
df[(df["dept"] == "IT") & (df["salary"] > 70000)]

    name dept  age  salary
3  David   IT   28   80000
4    Eve   IT   40   75000


Find rows where value > average.

In [11]:
avg_salary = df["salary"].mean()
df[df["salary"] > avg_salary]

      name dept  age  salary
3    David   IT   28   80000
4      Eve   IT   40   75000
2  Charlie   IT   35   70000